[Basic Data Exploration](#basic-explor)

[Bivariate analysis](#bivar)

## Course Structure

1. Module 0 - Native Data Types in Python
2. Module 1 - Intro to Pandas library & Basis Dataframe attributes
3. Module 2 - Common Data manipulation tasks using Pandas
4. Module 3 - Loops and Functions 
5. Module 4 - Visualization
6. Module 5 - Other miscellaneous topics

# Basic data types

In [ ]:
from IPython.core.interactiveshell import InteractiveShell
InteractiveShell.ast_node_interactivity = "all"

In [ ]:
x = [1,"b",3]

In [ ]:
my_list = [20,30,40,50,60,70]
my_list[0:-1]

In [ ]:
dict = {'name':'Rajat','class':'BCA','roll_no':41}
dict['name']
dict.keys()
#dict.values()

In [ ]:
x[1]

In [ ]:
student = {'s_1': ['IBM'],"s_2":["ITS","kellton_tech","Google"]}
student['s_2'][1]

In [ ]:
student_dict = {"s_1":["IBM","TCS"],"s_2" :["HP"], "s_3":["INFOSYS","WIPRO"]}

In [ ]:
[val for k,val in student_dict.items()]

In [ ]:
x = ["abe",1,"c"]

In [ ]:
dist_ex = {"S1":["HCL","TCS"],"S2":["Benz"]}

In [ ]:
for k,v in dist_ex.items():
    if k == "S1":
        print(k)

In [ ]:
x.append("h")

In [ ]:
x

In [ ]:
tup_ex = (1,2,3,1)

In [ ]:
!pip install pandas

In [ ]:
list_ex = [1,2,3]
dist_ex = {"Age":25,"Weight":70}

tup_ex = (1,2,3,1)

In [ ]:
from pandas import read_csv

In [1]:
# read the data
import pandas as pd
#import numpy as np
df = pd.read_csv("Uber Drives.csv")

In [2]:
df
#type(df)
#df.dtypes
#df.head(n=80)
#df.shape
#df.tail(n=17)

,START_DATE*,END_DATE*,CATEGORY*,START*,STOP*,MILES*,PURPOSE*
0,01-01-2016 21:11,01-01-2016 21:17,Business,Fort Pierce,Fort Pierce,5.1,Meal/Entertain
1,01-02-2016 01:25,01-02-2016 01:37,Business,Fort Pierce,Fort Pierce,5.0,NaN
2,01-02-2016 20:25,01-02-2016 20:38,Business,Fort Pierce,Fort Pierce,4.8,Errand/Supplies
3,01-05-2016 17:31,01-05-2016 17:45,Business,Fort Pierce,Fort Pierce,4.7,Meeting
4,01-06-2016 14:42,01-06-2016 15:49,Business,Fort Pierce,West Palm Beach,63.7,Customer Visit
...,...,...,...,...,...,...,...
1151,12/31/2016 13:24,12/31/2016 13:42,Business,Kar?chi,Unknown Location,3.9,Temporary Site
1152,12/31/2016 15:03,12/31/2016 15:38,Business,Unknown Location,Unknown Location,16.2,Meeting
1153,12/31/2016 21:32,12/31/2016 21:50,Business,Katunayake,Gampaha,6.4,Temporary Site
1154,12/31/2016 22:08,12/31/2016 23:51,Business,Gampaha,Ilukwatta,48.2,Temporary Site
1155,Totals,NaN,NaN,NaN,NaN,12204.7,NaN

# Key Modules

1. Basic Dataframe operations
2. Common data manipulation tasks
3. Loops and Functions

## Basic dataframe operations

In [4]:
df

,START_DATE*,END_DATE*,CATEGORY*,START*,STOP*,MILES*,PURPOSE*
0,01-01-2016 21:11,01-01-2016 21:17,Business,Fort Pierce,Fort Pierce,5.1,Meal/Entertain
1,01-02-2016 01:25,01-02-2016 01:37,Business,Fort Pierce,Fort Pierce,5.0,NaN
2,01-02-2016 20:25,01-02-2016 20:38,Business,Fort Pierce,Fort Pierce,4.8,Errand/Supplies
3,01-05-2016 17:31,01-05-2016 17:45,Business,Fort Pierce,Fort Pierce,4.7,Meeting
4,01-06-2016 14:42,01-06-2016 15:49,Business,Fort Pierce,West Palm Beach,63.7,Customer Visit
...,...,...,...,...,...,...,...
1151,12/31/2016 13:24,12/31/2016 13:42,Business,Kar?chi,Unknown Location,3.9,Temporary Site
1152,12/31/2016 15:03,12/31/2016 15:38,Business,Unknown Location,Unknown Location,16.2,Meeting
1153,12/31/2016 21:32,12/31/2016 21:50,Business,Katunayake,Gampaha,6.4,Temporary Site
1154,12/31/2016 22:08,12/31/2016 23:51,Business,Gampaha,Ilukwatta,48.2,Temporary Site
1155,Totals,NaN,NaN,NaN,NaN,12204.7,NaN

In [ ]:
df.shape

In [ ]:
hasattr(df,"head")
callable(getattr(df,"head"))

In [ ]:
df.tail()

In [ ]:
df.dtypes

### Changing data types

In [ ]:
temp = pd.DataFrame({"A":["1","2","3"],"B":[11,12,13],"C": ["12-06-2012","13-06-2015","15-06-2017"]})

In [ ]:
#temp
temp['C'] = pd.to_datetime(temp["C"])
temp.dtypes
pd.to_datetime(['2016-sept-12','2020-jan-13','abc'],errors = 'coerce')

In [ ]:
temp["C"] = pd.to_datetime(temp["C"])

In [ ]:
temp["A"] = pd.to_numeric(temp["A"])

In [ ]:
temp.dtypes

In [ ]:

temp["A"] = temp["A"].astype(str)

In [ ]:
temp.dtypes

In [ ]:
# convert data to datetime format
pd.to_datetime(df["START_DATE*"],format='%m/%d/%Y %H:%M')
# Available time formats: https://docs.python.org/3/library/datetime.html#strftime-and-strptime-behavior

### Dataset summarization methods

In [ ]:
df.describe(include="all")

In [ ]:
df.info()

In [ ]:
# count of unique start locations
df["PURPOSE*"].value_counts().head()

## Common data manipulation tasks

5 verbs of data manipulation

1. Selecting/Indexing
2. Filtering
3. Sorting
4. Mutating/ Conditionally adding columns
5. Groupby/Summarize

### Select/Indexing

In [ ]:
df.head()

In [ ]:
df.iloc[0:5,0:6]
df.iloc[:,2:4]
#df.shape

In [ ]:
rajat = df.iloc[:, :-1]
print(df.shape)
rajat.shape
df

In [ ]:
## Positional Indexing
df.iloc[0:4,[0,1]]

In [ ]:
df.iloc[0:4,0:3]

In [12]:
# label based indexing
df.loc[0:15,['START*',"STOP*"]]
#df[['START*','STOP*']]
df.loc[:,["START*",'STOP*']]

                START*             STOP*
0          Fort Pierce       Fort Pierce
1          Fort Pierce       Fort Pierce
2          Fort Pierce       Fort Pierce
3          Fort Pierce       Fort Pierce
4          Fort Pierce   West Palm Beach
...                ...               ...
1151           Kar?chi  Unknown Location
1152  Unknown Location  Unknown Location
1153        Katunayake           Gampaha
1154           Gampaha         Ilukwatta
1155               NaN               NaN

[1156 rows x 2 columns]

### In Class assignment

Extract first 5 rows and columns START_DATE* and MILES*

In [18]:
df.loc[0:4,['START_DATE*',"MILES*"]]

        START_DATE*  MILES*
0  01-01-2016 21:11     5.1
1  01-02-2016 01:25     5.0
2  01-02-2016 20:25     4.8
3  01-05-2016 17:31     4.7
4  01-06-2016 14:42    63.7

### Filtering

In [27]:
df[df["MILES*"] >10]

,START_DATE*,END_DATE*,CATEGORY*,START*,STOP*,MILES*,PURPOSE*
4,01-06-2016 14:42,01-06-2016 15:49,Business,Fort Pierce,West Palm Beach,63.7,Customer Visit
9,01-10-2016 12:17,01-10-2016 12:44,Business,Jamaica,New York,16.5,Customer Visit
10,01-10-2016 15:08,01-10-2016 15:51,Business,New York,Queens,10.8,Meeting
22,01-12-2016 16:02,01-12-2016 17:00,Business,New York,Queens County,15.1,Meeting
23,1/13/2016 13:54,1/13/2016 14:07,Business,Downtown,Gulfton,11.2,Meeting
...,...,...,...,...,...,...,...
1134,12/29/2016 11:28,12/29/2016 12:00,Business,Unknown Location,Kar?chi,11.9,Meal/Entertain
1144,12/29/2016 23:14,12/29/2016 23:47,Business,Unknown Location,Kar?chi,12.9,Meeting
1152,12/31/2016 15:03,12/31/2016 15:38,Business,Unknown Location,Unknown Location,16.2,Meeting
1154,12/31/2016 22:08,12/31/2016 23:51,Business,Gampaha,Ilukwatta,48.2,Temporary Site
1155,Totals,NaN,NaN,NaN,NaN,12204.7,NaN

In [25]:
df2 = df.loc[df["MILES*"] > 10,["START_DATE*","MILES*"]]
df

           START_DATE*   MILES*
4     01-06-2016 14:42     63.7
9     01-10-2016 12:17     16.5
10    01-10-2016 15:08     10.8
22    01-12-2016 16:02     15.1
23     1/13/2016 13:54     11.2
...                ...      ...
1134  12/29/2016 11:28     11.9
1144  12/29/2016 23:14     12.9
1152  12/31/2016 15:03     16.2
1154  12/31/2016 22:08     48.2
1155            Totals  12204.7

[316 rows x 2 columns]

In [ ]:
df3 = df2.loc[0:3]

In [ ]:
# find out all rides greater than 10 miles
df.loc[df["MILES*"] > 10].head()

In [ ]:
# Find out all rides to Cary
df.loc[df["START*"]=="Cary",["MILES*"]].head()

In [ ]:
# Find out all rides to Cary & Morrisville          
df[df["START*"].isin(["Cary","Morrisville"])].shape

In [ ]:
# Find out all rides to Cary & Morrisville          
df.loc[df["START*"].isin(["Cary","Morrisville"])].shape

In [ ]:
df.loc[~df["START*"].isin(["Cary","Morrisville"])].shape

#### In class assignment

1. Find all trips with distance > 10 miles and originating from Cary and Morris.

2. Extract top 3 rows from the filtered dataset

### Sorting

In [ ]:
df.sort_values(by=["MILES*"],ascending=False).head(5)

In [ ]:
df.sort_values(by=["START*", "MILES*"],ascending=[True,False]).head(5)

### Conditionally adding columns

In [ ]:
import numpy as np
df["miles_cat"] = np.where(df["MILES*"] > 5,"Long Trip","Short Trip")

In [ ]:
df.head()

In [ ]:
df["miles_cat"].value_counts()

In [ ]:
df.loc[df["MILES*"] > 5].shape

## In class Assignment

Create a new column with the following condition:

a) > 10 - Long Trip

b) 5 - 10  - Medium

c) < 5 - Short Trip

### Groupby Summarize

In [ ]:
# for each start loc find the mean distance travelled
df.groupby("START*")["MILES*"].agg("mean").head()

In [ ]:
# for each start loc find the mean & the total dist travelled
df.groupby("START*").agg(["mean","sum"]).head()

### In class assignment

Find most recent & the earliest travelled date and mean distance traveled for each start city

## Loops and Function

In [ ]:
# Basic for loop
res = []
temp = [1,2,3,4]
for i in temp:
    res.append(i*i)
res

In [ ]:
# List comprehension way

[x*x for x in temp]

In [ ]:
store_sales = pd.read_csv("store_sales.csv")

In [ ]:
store_sales.head()

In [ ]:
# find out avg sales for each month
# find out avg sales for each store

In [ ]:
def bonus_func(sales_numbers):
    return ["Eligible" if x > 15 else "Not Eligible" for x in sales_numbers]

In [ ]:
bonus_func([12,23,56])

In [ ]:
store_sales.iloc[:,2:].apply(bonus_func).head()

In [ ]:
store_sales.iloc[:,2:].apply(lambda sales_numbers: ["Eligible" if x > 15 else "Not Eligible" for x in sales_numbers]).head()

In [ ]:
store_sales.columns

In [ ]:
store_sales.groupby("city").agg("mean")

### Assignments

1) Find mean quarterly sales by store

2) Find the month with highest sales for each store

## Other/Miscellaneous topics

### Missing value treatment

In [ ]:
df.isnull().sum()

In [ ]:
## Count missing values
df.isnull().sum()

In [ ]:
# Fill NA with most common values
df["PURPOSE*"].value_counts()

In [ ]:
df = df.fillna({"PURPOSE*":"Meeting"})

In [ ]:
df["PURPOSE*"].value_counts()

### Matrix operations use case

### Example 1 - compute month on month growth in sales

In [ ]:
store_sales.head()

In [ ]:
sales_mat = np.array(store_sales.iloc[:,2:])

In [ ]:
sales_mat

In [ ]:
sales_mat_lag = sales_mat[:,1:]
sales_mat_lag

In [ ]:
sales_mat_lag = sales_mat[:,1:]
sales_mat_lag = np.c_[sales_mat_lag,np.zeros(100)]

In [ ]:
sales_diff = sales_mat_lag - sales_mat

In [ ]:
perct_change = pd.DataFrame(sales_diff/sales_mat)

In [ ]:
perct_change.head()

### Example 1 - compute net revenue

In [ ]:
profit_mat = np.random.uniform(low=0.05, high=0.25, size=(100,12))

In [ ]:
## Find total annual profit for each store
profit_mat = profit_mat.transpose()

In [ ]:
profit_mat.shape

In [ ]:
prof_matrix = np.dot(sales_mat,profit_mat)

In [ ]:
prof_matrix.shape